Ran Plan for 6 projects:

1. dir: `nz3es/gcp/prd/data-plane/australia-southeast2/dns-zone/nz3es-example-com` workspace: `nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-example-com`
1. dir: `nz3es/gcp/stg/data-plane/australia-southeast2/dns-zone/nz3es-example-com` workspace: `nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-example-com`
1. dir: `nz3es/gcp/prd/data-plane/australia-southeast2/network` workspace: `nz3es_gcp_prd_data-plane_australia-southeast2_network`
1. dir: `nz3es/gcp/stg/data-plane/australia-southeast2/network` workspace: `nz3es_gcp_stg_data-plane_australia-southeast2_network`
1. dir: `nz3es/gcp/stg/data-plane/australia-southeast2/dns-zone/nz3es-internal` workspace: `nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-internal`
1. dir: `nz3es/gcp/prd/data-plane/australia-southeast2/dns-zone/nz3es-internal` workspace: `nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-internal`
---

### 1. dir: `nz3es/gcp/prd/data-plane/australia-southeast2/dns-zone/nz3es-example-com` workspace: `nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-example-com`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/iac/8/nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-example-com...

01:43:24.447 INFO   Downloading Terraform configurations from ../../../../../../../modules/dns into ./.terragrunt-cache/P58g4xHBWymDZ1EuisksGlewo7E/qENOjMBmuI6J7Fljlqs7icKI760
01:43:24.484 INFO   terraform1.13.3: Initializing the backend...
01:43:25.224 INFO   terraform1.13.3: 
01:43:25.224 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
01:43:25.224 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
01:43:25.505 INFO   terraform1.13.3: Initializing provider plugins...
01:43:25.505 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 4.0.0"...
01:43:25.739 INFO   terraform1.13.3: - Using hashicorp/google v7.15.0 from the shared cache directory
01:43:26.070 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:43:26.071 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
01:43:26.071 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
01:43:26.071 INFO   terraform1.13.3: you run "terraform init" in the future.
01:43:26.071 INFO   terraform1.13.3: ╷
01:43:26.071 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
01:43:26.072 INFO   terraform1.13.3: │ 
01:43:26.072 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
01:43:26.072 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
01:43:26.072 INFO   terraform1.13.3: │   - hashicorp/google
01:43:26.072 INFO   terraform1.13.3: │ 
01:43:26.072 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
01:43:26.072 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
01:43:26.072 INFO   terraform1.13.3: │ these providers.
01:43:26.072 INFO   terraform1.13.3: │ 
01:43:26.072 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
01:43:26.073 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
01:43:26.073 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
01:43:26.073 INFO   terraform1.13.3: ╵
01:43:26.073 INFO   terraform1.13.3: Terraform has been successfully initialized!
01:43:29.231 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
01:43:29.232 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
01:43:29.232 STDOUT terraform1.13.3:   + create
01:43:29.232 STDOUT terraform1.13.3: Terraform will perform the following actions:
01:43:29.232 STDOUT terraform1.13.3:   # google_dns_managed_zone.dns_zone will be created
01:43:29.232 STDOUT terraform1.13.3:   + resource "google_dns_managed_zone" "dns_zone" {
01:43:29.232 STDOUT terraform1.13.3:       + creation_time    = (known after apply)
01:43:29.232 STDOUT terraform1.13.3:       + description      = "Public DNS zone nz3es.example.com. for prd environment"
01:43:29.232 STDOUT terraform1.13.3:       + dns_name         = "nz3es.example.com."
01:43:29.232 STDOUT terraform1.13.3:       + effective_labels = {
01:43:29.232 STDOUT terraform1.13.3:           + "environment"                = "prd"
01:43:29.233 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
01:43:29.233 STDOUT terraform1.13.3:           + "managed_by"                 = "terraform"
01:43:29.233 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
01:43:29.233 STDOUT terraform1.13.3:           + "zone_type"                  = "public"
01:43:29.233 STDOUT terraform1.13.3:         }
01:43:29.233 STDOUT terraform1.13.3:       + force_destroy    = false
01:43:29.233 STDOUT terraform1.13.3:       + id               = (known after apply)
01:43:29.233 STDOUT terraform1.13.3:       + labels           = {
01:43:29.233 STDOUT terraform1.13.3:           + "environment" = "prd"
01:43:29.233 STDOUT terraform1.13.3:           + "managed_by"  = "terraform"
01:43:29.233 STDOUT terraform1.13.3:           + "region"      = "australia-southeast2"
01:43:29.233 STDOUT terraform1.13.3:           + "zone_type"   = "public"
01:43:29.234 STDOUT terraform1.13.3:         }
01:43:29.234 STDOUT terraform1.13.3:       + managed_zone_id  = (known after apply)
01:43:29.234 STDOUT terraform1.13.3:       + name             = "prd-nz3es-example-com-zone"
01:43:29.234 STDOUT terraform1.13.3:       + name_servers     = (known after apply)
01:43:29.234 STDOUT terraform1.13.3:       + project          = "iac-01"
01:43:29.234 STDOUT terraform1.13.3:       + terraform_labels = {
01:43:29.234 STDOUT terraform1.13.3:           + "environment"                = "prd"
01:43:29.234 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
01:43:29.234 STDOUT terraform1.13.3:           + "managed_by"                 = "terraform"
01:43:29.234 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
01:43:29.234 STDOUT terraform1.13.3:           + "zone_type"                  = "public"
01:43:29.235 STDOUT terraform1.13.3:         }
01:43:29.235 STDOUT terraform1.13.3:       + visibility       = "public"
01:43:29.235 STDOUT terraform1.13.3:       + cloud_logging_config (known after apply)
01:43:29.235 STDOUT terraform1.13.3:       + dnssec_config (known after apply)
01:43:29.235 STDOUT terraform1.13.3:     }
01:43:29.235 STDOUT terraform1.13.3:   # google_dns_record_set.records["0"] will be created
01:43:29.235 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
01:43:29.235 STDOUT terraform1.13.3:       + id           = (known after apply)
01:43:29.235 STDOUT terraform1.13.3:       + managed_zone = "prd-nz3es-example-com-zone"
01:43:29.235 STDOUT terraform1.13.3:       + name         = "nz3es.example.com."
01:43:29.235 STDOUT terraform1.13.3:       + project      = "iac-01"
01:43:29.235 STDOUT terraform1.13.3:       + rrdatas      = [
01:43:29.235 STDOUT terraform1.13.3:           + "10.0.0.10",
01:43:29.236 STDOUT terraform1.13.3:         ]
01:43:29.236 STDOUT terraform1.13.3:       + ttl          = 300
01:43:29.236 STDOUT terraform1.13.3:       + type         = "A"
01:43:29.236 STDOUT terraform1.13.3:     }
01:43:29.236 STDOUT terraform1.13.3:   # google_dns_record_set.records["1"] will be created
01:43:29.236 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
01:43:29.236 STDOUT terraform1.13.3:       + id           = (known after apply)
01:43:29.236 STDOUT terraform1.13.3:       + managed_zone = "prd-nz3es-example-com-zone"
01:43:29.236 STDOUT terraform1.13.3:       + name         = "app.nz3es.example.com."
01:43:29.236 STDOUT terraform1.13.3:       + project      = "iac-01"
01:43:29.236 STDOUT terraform1.13.3:       + rrdatas      = [
01:43:29.236 STDOUT terraform1.13.3:           + "10.0.0.20",
01:43:29.236 STDOUT terraform1.13.3:         ]
01:43:29.236 STDOUT terraform1.13.3:       + ttl          = 300
01:43:29.236 STDOUT terraform1.13.3:       + type         = "A"
01:43:29.237 STDOUT terraform1.13.3:     }
01:43:29.237 STDOUT terraform1.13.3:   # google_dns_record_set.records["2"] will be created
01:43:29.237 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
01:43:29.237 STDOUT terraform1.13.3:       + id           = (known after apply)
01:43:29.237 STDOUT terraform1.13.3:       + managed_zone = "prd-nz3es-example-com-zone"
01:43:29.237 STDOUT terraform1.13.3:       + name         = "www.nz3es.example.com."
01:43:29.237 STDOUT terraform1.13.3:       + project      = "iac-01"
01:43:29.237 STDOUT terraform1.13.3:       + rrdatas      = [
01:43:29.237 STDOUT terraform1.13.3:           + "app.nz3es.example.com.",
01:43:29.237 STDOUT terraform1.13.3:         ]
01:43:29.237 STDOUT terraform1.13.3:       + ttl          = 300
01:43:29.237 STDOUT terraform1.13.3:       + type         = "CNAME"
01:43:29.237 STDOUT terraform1.13.3:     }
01:43:29.237 STDOUT terraform1.13.3: Plan: 4 to add, 0 to change, 0 to destroy.
01:43:29.237 STDOUT terraform1.13.3: 
01:43:29.237 STDOUT terraform1.13.3: Changes to Outputs:
01:43:29.237 STDOUT terraform1.13.3:   + name_servers = (known after apply)
01:43:29.238 STDOUT terraform1.13.3:   + zone_id      = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/prd/data-plane/australia-southeast2/dns-zone/nz3es-example-com -w nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-example-com
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fprd%252Fdata-plane%252Faustralia-southeast2%252Fdns-zone%252Fnz3es-example-com%252Fnz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-example-com)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/prd/data-plane/australia-southeast2/dns-zone/nz3es-example-com -w nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-example-com
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 2. dir: `nz3es/gcp/stg/data-plane/australia-southeast2/dns-zone/nz3es-example-com` workspace: `nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-example-com`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/iac/8/nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-example-com...

01:43:24.383 INFO   Downloading Terraform configurations from ../../../../../../../modules/dns into ./.terragrunt-cache/96bnTAfa0N9UvrZAUva3gGDr4Uk/bV48eIU47PzS4vTBa96Gh9jEc4c
01:43:24.432 INFO   terraform1.13.3: Initializing the backend...
01:43:25.209 INFO   terraform1.13.3: 
01:43:25.210 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
01:43:25.210 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
01:43:25.496 INFO   terraform1.13.3: Initializing provider plugins...
01:43:25.497 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 4.0.0"...
01:43:25.739 INFO   terraform1.13.3: - Using hashicorp/google v7.15.0 from the shared cache directory
01:43:26.070 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:43:26.071 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
01:43:26.071 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
01:43:26.071 INFO   terraform1.13.3: you run "terraform init" in the future.
01:43:26.071 INFO   terraform1.13.3: ╷
01:43:26.071 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
01:43:26.071 INFO   terraform1.13.3: │ 
01:43:26.071 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
01:43:26.071 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
01:43:26.071 INFO   terraform1.13.3: │   - hashicorp/google
01:43:26.071 INFO   terraform1.13.3: │ 
01:43:26.071 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
01:43:26.071 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
01:43:26.071 INFO   terraform1.13.3: │ these providers.
01:43:26.071 INFO   terraform1.13.3: │ 
01:43:26.071 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
01:43:26.072 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
01:43:26.072 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
01:43:26.072 INFO   terraform1.13.3: ╵
01:43:26.072 INFO   terraform1.13.3: Terraform has been successfully initialized!
01:43:29.229 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
01:43:29.229 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
01:43:29.229 STDOUT terraform1.13.3:   + create
01:43:29.229 STDOUT terraform1.13.3: Terraform will perform the following actions:
01:43:29.229 STDOUT terraform1.13.3:   # google_dns_managed_zone.dns_zone will be created
01:43:29.230 STDOUT terraform1.13.3:   + resource "google_dns_managed_zone" "dns_zone" {
01:43:29.230 STDOUT terraform1.13.3:       + creation_time    = (known after apply)
01:43:29.230 STDOUT terraform1.13.3:       + description      = "Public DNS zone nz3es.example.com. for stg environment"
01:43:29.230 STDOUT terraform1.13.3:       + dns_name         = "nz3es.example.com."
01:43:29.230 STDOUT terraform1.13.3:       + effective_labels = {
01:43:29.230 STDOUT terraform1.13.3:           + "environment"                = "stg"
01:43:29.230 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
01:43:29.230 STDOUT terraform1.13.3:           + "managed_by"                 = "terraform"
01:43:29.231 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
01:43:29.231 STDOUT terraform1.13.3:           + "zone_type"                  = "public"
01:43:29.231 STDOUT terraform1.13.3:         }
01:43:29.231 STDOUT terraform1.13.3:       + force_destroy    = false
01:43:29.231 STDOUT terraform1.13.3:       + id               = (known after apply)
01:43:29.231 STDOUT terraform1.13.3:       + labels           = {
01:43:29.231 STDOUT terraform1.13.3:           + "environment" = "stg"
01:43:29.231 STDOUT terraform1.13.3:           + "managed_by"  = "terraform"
01:43:29.231 STDOUT terraform1.13.3:           + "region"      = "australia-southeast2"
01:43:29.232 STDOUT terraform1.13.3:           + "zone_type"   = "public"
01:43:29.232 STDOUT terraform1.13.3:         }
01:43:29.232 STDOUT terraform1.13.3:       + managed_zone_id  = (known after apply)
01:43:29.232 STDOUT terraform1.13.3:       + name             = "stg-nz3es-example-com-zone"
01:43:29.232 STDOUT terraform1.13.3:       + name_servers     = (known after apply)
01:43:29.232 STDOUT terraform1.13.3:       + project          = "iac-01"
01:43:29.232 STDOUT terraform1.13.3:       + terraform_labels = {
01:43:29.232 STDOUT terraform1.13.3:           + "environment"                = "stg"
01:43:29.232 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
01:43:29.233 STDOUT terraform1.13.3:           + "managed_by"                 = "terraform"
01:43:29.233 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
01:43:29.233 STDOUT terraform1.13.3:           + "zone_type"                  = "public"
01:43:29.233 STDOUT terraform1.13.3:         }
01:43:29.233 STDOUT terraform1.13.3:       + visibility       = "public"
01:43:29.233 STDOUT terraform1.13.3:       + cloud_logging_config (known after apply)
01:43:29.233 STDOUT terraform1.13.3:       + dnssec_config (known after apply)
01:43:29.233 STDOUT terraform1.13.3:     }
01:43:29.233 STDOUT terraform1.13.3:   # google_dns_record_set.records["0"] will be created
01:43:29.233 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
01:43:29.233 STDOUT terraform1.13.3:       + id           = (known after apply)
01:43:29.233 STDOUT terraform1.13.3:       + managed_zone = "stg-nz3es-example-com-zone"
01:43:29.234 STDOUT terraform1.13.3:       + name         = "stg.nz3es.example.com."
01:43:29.234 STDOUT terraform1.13.3:       + project      = "iac-01"
01:43:29.234 STDOUT terraform1.13.3:       + rrdatas      = [
01:43:29.234 STDOUT terraform1.13.3:           + "10.1.0.10",
01:43:29.234 STDOUT terraform1.13.3:         ]
01:43:29.234 STDOUT terraform1.13.3:       + ttl          = 300
01:43:29.234 STDOUT terraform1.13.3:       + type         = "A"
01:43:29.234 STDOUT terraform1.13.3:     }
01:43:29.234 STDOUT terraform1.13.3:   # google_dns_record_set.records["1"] will be created
01:43:29.234 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
01:43:29.234 STDOUT terraform1.13.3:       + id           = (known after apply)
01:43:29.234 STDOUT terraform1.13.3:       + managed_zone = "stg-nz3es-example-com-zone"
01:43:29.235 STDOUT terraform1.13.3:       + name         = "app.stg.nz3es.example.com."
01:43:29.235 STDOUT terraform1.13.3:       + project      = "iac-01"
01:43:29.235 STDOUT terraform1.13.3:       + rrdatas      = [
01:43:29.235 STDOUT terraform1.13.3:           + "10.1.0.20",
01:43:29.235 STDOUT terraform1.13.3:         ]
01:43:29.235 STDOUT terraform1.13.3:       + ttl          = 300
01:43:29.235 STDOUT terraform1.13.3:       + type         = "A"
01:43:29.235 STDOUT terraform1.13.3:     }
01:43:29.235 STDOUT terraform1.13.3:   # google_dns_record_set.records["2"] will be created
01:43:29.235 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
01:43:29.235 STDOUT terraform1.13.3:       + id           = (known after apply)
01:43:29.235 STDOUT terraform1.13.3:       + managed_zone = "stg-nz3es-example-com-zone"
01:43:29.235 STDOUT terraform1.13.3:       + name         = "www.stg.nz3es.example.com."
01:43:29.235 STDOUT terraform1.13.3:       + project      = "iac-01"
01:43:29.235 STDOUT terraform1.13.3:       + rrdatas      = [
01:43:29.236 STDOUT terraform1.13.3:           + "app.stg.nz3es.example.com.",
01:43:29.236 STDOUT terraform1.13.3:         ]
01:43:29.236 STDOUT terraform1.13.3:       + ttl          = 300
01:43:29.236 STDOUT terraform1.13.3:       + type         = "CNAME"
01:43:29.236 STDOUT terraform1.13.3:     }
01:43:29.236 STDOUT terraform1.13.3: Plan: 4 to add, 0 to change, 0 to destroy.
01:43:29.236 STDOUT terraform1.13.3: 
01:43:29.236 STDOUT terraform1.13.3: Changes to Outputs:
01:43:29.236 STDOUT terraform1.13.3:   + name_servers = (known after apply)
01:43:29.236 STDOUT terraform1.13.3:   + zone_id      = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/stg/data-plane/australia-southeast2/dns-zone/nz3es-example-com -w nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-example-com
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fstg%252Fdata-plane%252Faustralia-southeast2%252Fdns-zone%252Fnz3es-example-com%252Fnz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-example-com)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/stg/data-plane/australia-southeast2/dns-zone/nz3es-example-com -w nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-example-com
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 3. dir: `nz3es/gcp/prd/data-plane/australia-southeast2/network` workspace: `nz3es_gcp_prd_data-plane_australia-southeast2_network`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/iac/8/nz3es_gcp_prd_data-plane_australia-southeast2_network...

01:43:24.336 INFO   Downloading Terraform configurations from ../../../../../../modules/vpc into ./.terragrunt-cache/y5e7qb3yjPJEeeqhw0LljQAU58s/B1Rd9H8_qtBGhW6Z7j9LkJr5hcs
01:43:24.392 INFO   terraform1.13.3: Initializing the backend...
01:43:25.210 INFO   terraform1.13.3: 
01:43:25.210 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
01:43:25.210 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
01:43:25.505 INFO   terraform1.13.3: Initializing provider plugins...
01:43:25.505 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 4.0.0"...
01:43:25.738 INFO   terraform1.13.3: - Using hashicorp/google v7.15.0 from the shared cache directory
01:43:26.071 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:43:26.071 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
01:43:26.071 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
01:43:26.071 INFO   terraform1.13.3: you run "terraform init" in the future.
01:43:26.071 INFO   terraform1.13.3: ╷
01:43:26.071 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
01:43:26.071 INFO   terraform1.13.3: │ 
01:43:26.071 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
01:43:26.071 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
01:43:26.071 INFO   terraform1.13.3: │   - hashicorp/google
01:43:26.071 INFO   terraform1.13.3: │ 
01:43:26.071 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
01:43:26.071 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
01:43:26.071 INFO   terraform1.13.3: │ these providers.
01:43:26.072 INFO   terraform1.13.3: │ 
01:43:26.072 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
01:43:26.072 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
01:43:26.072 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
01:43:26.072 INFO   terraform1.13.3: ╵
01:43:26.072 INFO   terraform1.13.3: Terraform has been successfully initialized!
01:43:29.193 STDOUT terraform1.13.3: google_compute_network.vpc_network: Refreshing state... [id=projects/iac-01/global/networks/prd-vpc-australia-southeast2]
01:43:30.350 STDOUT terraform1.13.3: google_compute_subnetwork.subnet: Refreshing state... [id=projects/iac-01/regions/australia-southeast2/subnetworks/prd-vpc-australia-southeast2-subnet]
01:43:30.693 STDOUT terraform1.13.3: No changes. Your infrastructure matches the configuration.
01:43:30.693 STDOUT terraform1.13.3: Terraform has compared your real infrastructure against your configuration
01:43:30.694 STDOUT terraform1.13.3: and found no differences, so no changes are needed.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/prd/data-plane/australia-southeast2/network -w nz3es_gcp_prd_data-plane_australia-southeast2_network
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fprd%252Fdata-plane%252Faustralia-southeast2%252Fnetwork%252Fnz3es_gcp_prd_data-plane_australia-southeast2_network)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/prd/data-plane/australia-southeast2/network -w nz3es_gcp_prd_data-plane_australia-southeast2_network
  ```
No changes. Your infrastructure matches the configuration.

---
### 4. dir: `nz3es/gcp/stg/data-plane/australia-southeast2/network` workspace: `nz3es_gcp_stg_data-plane_australia-southeast2_network`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/iac/8/nz3es_gcp_stg_data-plane_australia-southeast2_network...

01:43:24.453 INFO   Downloading Terraform configurations from ../../../../../../modules/vpc into ./.terragrunt-cache/cS_BBJCx2txOIB7XH6k7ofZnN24/b2EOpn6WvWWGY7MsGEmDAoAlbh4
01:43:24.489 INFO   terraform1.13.3: Initializing the backend...
01:43:25.190 INFO   terraform1.13.3: 
01:43:25.190 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
01:43:25.190 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
01:43:25.482 INFO   terraform1.13.3: Initializing provider plugins...
01:43:25.482 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 4.0.0"...
01:43:25.740 INFO   terraform1.13.3: - Using hashicorp/google v7.15.0 from the shared cache directory
01:43:26.071 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:43:26.071 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
01:43:26.071 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
01:43:26.071 INFO   terraform1.13.3: you run "terraform init" in the future.
01:43:26.071 INFO   terraform1.13.3: ╷
01:43:26.071 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
01:43:26.071 INFO   terraform1.13.3: │ 
01:43:26.071 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
01:43:26.071 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
01:43:26.071 INFO   terraform1.13.3: │   - hashicorp/google
01:43:26.071 INFO   terraform1.13.3: │ 
01:43:26.072 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
01:43:26.072 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
01:43:26.072 INFO   terraform1.13.3: │ these providers.
01:43:26.072 INFO   terraform1.13.3: │ 
01:43:26.072 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
01:43:26.072 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
01:43:26.072 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
01:43:26.072 INFO   terraform1.13.3: ╵
01:43:26.072 INFO   terraform1.13.3: Terraform has been successfully initialized!
01:43:29.171 STDOUT terraform1.13.3: google_compute_network.vpc_network: Refreshing state... [id=projects/iac-01/global/networks/stg-vpc-australia-southeast2]
01:43:30.350 STDOUT terraform1.13.3: google_compute_subnetwork.subnet: Refreshing state... [id=projects/iac-01/regions/australia-southeast2/subnetworks/stg-vpc-australia-southeast2-subnet]
01:43:31.089 STDOUT terraform1.13.3: No changes. Your infrastructure matches the configuration.
01:43:31.091 STDOUT terraform1.13.3: Terraform has compared your real infrastructure against your configuration
01:43:31.092 STDOUT terraform1.13.3: and found no differences, so no changes are needed.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/stg/data-plane/australia-southeast2/network -w nz3es_gcp_stg_data-plane_australia-southeast2_network
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fstg%252Fdata-plane%252Faustralia-southeast2%252Fnetwork%252Fnz3es_gcp_stg_data-plane_australia-southeast2_network)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/stg/data-plane/australia-southeast2/network -w nz3es_gcp_stg_data-plane_australia-southeast2_network
  ```
No changes. Your infrastructure matches the configuration.

---
### 5. dir: `nz3es/gcp/stg/data-plane/australia-southeast2/dns-zone/nz3es-internal` workspace: `nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-internal`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/iac/8/nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-internal...

01:43:35.294 INFO   Downloading Terraform configurations from ../../../../../../../modules/dns into ./.terragrunt-cache/kOzTwaaGjOvZTF6o_GKVpheMBtQ/AZAU2NX-h6IJCO-dME8UppzGsZE
01:43:35.335 INFO   terraform1.13.3: Initializing the backend...
01:43:36.052 INFO   terraform1.13.3: 
01:43:36.053 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
01:43:36.053 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
01:43:36.326 INFO   terraform1.13.3: Initializing provider plugins...
01:43:36.327 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 4.0.0"...
01:43:36.537 INFO   terraform1.13.3: - Using hashicorp/google v7.15.0 from the shared cache directory
01:43:36.881 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:43:36.881 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
01:43:36.881 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
01:43:36.881 INFO   terraform1.13.3: you run "terraform init" in the future.
01:43:36.881 INFO   terraform1.13.3: ╷
01:43:36.881 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
01:43:36.881 INFO   terraform1.13.3: │ 
01:43:36.881 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
01:43:36.881 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
01:43:36.881 INFO   terraform1.13.3: │   - hashicorp/google
01:43:36.881 INFO   terraform1.13.3: │ 
01:43:36.881 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
01:43:36.882 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
01:43:36.882 INFO   terraform1.13.3: │ these providers.
01:43:36.882 INFO   terraform1.13.3: │ 
01:43:36.882 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
01:43:36.882 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
01:43:36.882 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
01:43:36.882 INFO   terraform1.13.3: ╵
01:43:36.882 INFO   terraform1.13.3: Terraform has been successfully initialized!
01:43:39.720 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
01:43:39.720 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
01:43:39.720 STDOUT terraform1.13.3:   + create
01:43:39.720 STDOUT terraform1.13.3: Terraform will perform the following actions:
01:43:39.720 STDOUT terraform1.13.3:   # google_dns_managed_zone.dns_zone will be created
01:43:39.720 STDOUT terraform1.13.3:   + resource "google_dns_managed_zone" "dns_zone" {
01:43:39.720 STDOUT terraform1.13.3:       + creation_time    = (known after apply)
01:43:39.720 STDOUT terraform1.13.3:       + description      = "Internal DNS zone nz3es.internal. for stg environment"
01:43:39.721 STDOUT terraform1.13.3:       + dns_name         = "nz3es.internal."
01:43:39.721 STDOUT terraform1.13.3:       + effective_labels = {
01:43:39.721 STDOUT terraform1.13.3:           + "environment"                = "stg"
01:43:39.721 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
01:43:39.721 STDOUT terraform1.13.3:           + "managed_by"                 = "terraform"
01:43:39.721 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
01:43:39.721 STDOUT terraform1.13.3:           + "zone_type"                  = "internal"
01:43:39.722 STDOUT terraform1.13.3:         }
01:43:39.722 STDOUT terraform1.13.3:       + force_destroy    = false
01:43:39.722 STDOUT terraform1.13.3:       + id               = (known after apply)
01:43:39.722 STDOUT terraform1.13.3:       + labels           = {
01:43:39.722 STDOUT terraform1.13.3:           + "environment" = "stg"
01:43:39.722 STDOUT terraform1.13.3:           + "managed_by"  = "terraform"
01:43:39.722 STDOUT terraform1.13.3:           + "region"      = "australia-southeast2"
01:43:39.722 STDOUT terraform1.13.3:           + "zone_type"   = "internal"
01:43:39.722 STDOUT terraform1.13.3:         }
01:43:39.722 STDOUT terraform1.13.3:       + managed_zone_id  = (known after apply)
01:43:39.722 STDOUT terraform1.13.3:       + name             = "stg-nz3es-internal-zone"
01:43:39.722 STDOUT terraform1.13.3:       + name_servers     = (known after apply)
01:43:39.722 STDOUT terraform1.13.3:       + project          = "iac-01"
01:43:39.723 STDOUT terraform1.13.3:       + terraform_labels = {
01:43:39.723 STDOUT terraform1.13.3:           + "environment"                = "stg"
01:43:39.723 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
01:43:39.723 STDOUT terraform1.13.3:           + "managed_by"                 = "terraform"
01:43:39.723 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
01:43:39.723 STDOUT terraform1.13.3:           + "zone_type"                  = "internal"
01:43:39.723 STDOUT terraform1.13.3:         }
01:43:39.723 STDOUT terraform1.13.3:       + visibility       = "private"
01:43:39.723 STDOUT terraform1.13.3:       + cloud_logging_config (known after apply)
01:43:39.724 STDOUT terraform1.13.3:       + dnssec_config (known after apply)
01:43:39.724 STDOUT terraform1.13.3:       + private_visibility_config {
01:43:39.724 STDOUT terraform1.13.3:           + networks {
01:43:39.724 STDOUT terraform1.13.3:               + network_url = "https://www.googleapis.com/compute/v1/projects/iac-01/global/networks/stg-vpc-australia-southeast2"
01:43:39.724 STDOUT terraform1.13.3:             }
01:43:39.724 STDOUT terraform1.13.3:         }
01:43:39.724 STDOUT terraform1.13.3:     }
01:43:39.724 STDOUT terraform1.13.3:   # google_dns_record_set.records["0"] will be created
01:43:39.724 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
01:43:39.724 STDOUT terraform1.13.3:       + id           = (known after apply)
01:43:39.725 STDOUT terraform1.13.3:       + managed_zone = "stg-nz3es-internal-zone"
01:43:39.725 STDOUT terraform1.13.3:       + name         = "db.stg.nz3es.internal."
01:43:39.725 STDOUT terraform1.13.3:       + project      = "iac-01"
01:43:39.725 STDOUT terraform1.13.3:       + rrdatas      = [
01:43:39.725 STDOUT terraform1.13.3:           + "10.1.0.100",
01:43:39.725 STDOUT terraform1.13.3:         ]
01:43:39.725 STDOUT terraform1.13.3:       + ttl          = 300
01:43:39.725 STDOUT terraform1.13.3:       + type         = "A"
01:43:39.725 STDOUT terraform1.13.3:     }
01:43:39.725 STDOUT terraform1.13.3:   # google_dns_record_set.records["1"] will be created
01:43:39.725 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
01:43:39.725 STDOUT terraform1.13.3:       + id           = (known after apply)
01:43:39.726 STDOUT terraform1.13.3:       + managed_zone = "stg-nz3es-internal-zone"
01:43:39.726 STDOUT terraform1.13.3:       + name         = "cache.stg.nz3es.internal."
01:43:39.726 STDOUT terraform1.13.3:       + project      = "iac-01"
01:43:39.726 STDOUT terraform1.13.3:       + rrdatas      = [
01:43:39.726 STDOUT terraform1.13.3:           + "10.1.0.101",
01:43:39.726 STDOUT terraform1.13.3:         ]
01:43:39.726 STDOUT terraform1.13.3:       + ttl          = 300
01:43:39.726 STDOUT terraform1.13.3:       + type         = "A"
01:43:39.726 STDOUT terraform1.13.3:     }
01:43:39.726 STDOUT terraform1.13.3:   # google_dns_record_set.records["2"] will be created
01:43:39.726 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
01:43:39.726 STDOUT terraform1.13.3:       + id           = (known after apply)
01:43:39.726 STDOUT terraform1.13.3:       + managed_zone = "stg-nz3es-internal-zone"
01:43:39.727 STDOUT terraform1.13.3:       + name         = "api.stg.nz3es.internal."
01:43:39.727 STDOUT terraform1.13.3:       + project      = "iac-01"
01:43:39.727 STDOUT terraform1.13.3:       + rrdatas      = [
01:43:39.727 STDOUT terraform1.13.3:           + "10.1.0.102",
01:43:39.727 STDOUT terraform1.13.3:         ]
01:43:39.727 STDOUT terraform1.13.3:       + ttl          = 300
01:43:39.727 STDOUT terraform1.13.3:       + type         = "A"
01:43:39.727 STDOUT terraform1.13.3:     }
01:43:39.727 STDOUT terraform1.13.3: Plan: 4 to add, 0 to change, 0 to destroy.
01:43:39.727 STDOUT terraform1.13.3: 
01:43:39.727 STDOUT terraform1.13.3: Changes to Outputs:
01:43:39.727 STDOUT terraform1.13.3:   + name_servers = (known after apply)
01:43:39.727 STDOUT terraform1.13.3:   + zone_id      = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/stg/data-plane/australia-southeast2/dns-zone/nz3es-internal -w nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-internal
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fstg%252Fdata-plane%252Faustralia-southeast2%252Fdns-zone%252Fnz3es-internal%252Fnz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-internal)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/stg/data-plane/australia-southeast2/dns-zone/nz3es-internal -w nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-internal
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 6. dir: `nz3es/gcp/prd/data-plane/australia-southeast2/dns-zone/nz3es-internal` workspace: `nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-internal`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/iac/8/nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-internal...

01:43:35.305 INFO   Downloading Terraform configurations from ../../../../../../../modules/dns into ./.terragrunt-cache/N4Hdet1jnWRfP6Jp3z1zwmwJdPw/PQB7YW07gXyir5GZry4YQZJ4PEg
01:43:35.349 INFO   terraform1.13.3: Initializing the backend...
01:43:36.073 INFO   terraform1.13.3: 
01:43:36.073 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
01:43:36.073 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
01:43:36.369 INFO   terraform1.13.3: Initializing provider plugins...
01:43:36.369 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 4.0.0"...
01:43:36.584 INFO   terraform1.13.3: - Using hashicorp/google v7.15.0 from the shared cache directory
01:43:36.916 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:43:36.917 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
01:43:36.917 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
01:43:36.917 INFO   terraform1.13.3: you run "terraform init" in the future.
01:43:36.917 INFO   terraform1.13.3: ╷
01:43:36.917 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
01:43:36.917 INFO   terraform1.13.3: │ 
01:43:36.917 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
01:43:36.917 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
01:43:36.917 INFO   terraform1.13.3: │   - hashicorp/google
01:43:36.917 INFO   terraform1.13.3: │ 
01:43:36.917 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
01:43:36.918 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
01:43:36.918 INFO   terraform1.13.3: │ these providers.
01:43:36.918 INFO   terraform1.13.3: │ 
01:43:36.918 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
01:43:36.918 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
01:43:36.918 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
01:43:36.918 INFO   terraform1.13.3: ╵
01:43:36.918 INFO   terraform1.13.3: Terraform has been successfully initialized!
01:43:39.750 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
01:43:39.751 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
01:43:39.751 STDOUT terraform1.13.3:   + create
01:43:39.751 STDOUT terraform1.13.3: Terraform will perform the following actions:
01:43:39.751 STDOUT terraform1.13.3:   # google_dns_managed_zone.dns_zone will be created
01:43:39.751 STDOUT terraform1.13.3:   + resource "google_dns_managed_zone" "dns_zone" {
01:43:39.751 STDOUT terraform1.13.3:       + creation_time    = (known after apply)
01:43:39.751 STDOUT terraform1.13.3:       + description      = "Internal DNS zone nz3es.internal. for prd environment"
01:43:39.751 STDOUT terraform1.13.3:       + dns_name         = "nz3es.internal."
01:43:39.751 STDOUT terraform1.13.3:       + effective_labels = {
01:43:39.751 STDOUT terraform1.13.3:           + "environment"                = "prd"
01:43:39.752 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
01:43:39.752 STDOUT terraform1.13.3:           + "managed_by"                 = "terraform"
01:43:39.752 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
01:43:39.752 STDOUT terraform1.13.3:           + "zone_type"                  = "internal"
01:43:39.752 STDOUT terraform1.13.3:         }
01:43:39.752 STDOUT terraform1.13.3:       + force_destroy    = false
01:43:39.752 STDOUT terraform1.13.3:       + id               = (known after apply)
01:43:39.752 STDOUT terraform1.13.3:       + labels           = {
01:43:39.752 STDOUT terraform1.13.3:           + "environment" = "prd"
01:43:39.752 STDOUT terraform1.13.3:           + "managed_by"  = "terraform"
01:43:39.752 STDOUT terraform1.13.3:           + "region"      = "australia-southeast2"
01:43:39.752 STDOUT terraform1.13.3:           + "zone_type"   = "internal"
01:43:39.752 STDOUT terraform1.13.3:         }
01:43:39.752 STDOUT terraform1.13.3:       + managed_zone_id  = (known after apply)
01:43:39.753 STDOUT terraform1.13.3:       + name             = "prd-nz3es-internal-zone"
01:43:39.753 STDOUT terraform1.13.3:       + name_servers     = (known after apply)
01:43:39.753 STDOUT terraform1.13.3:       + project          = "iac-01"
01:43:39.753 STDOUT terraform1.13.3:       + terraform_labels = {
01:43:39.753 STDOUT terraform1.13.3:           + "environment"                = "prd"
01:43:39.753 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
01:43:39.753 STDOUT terraform1.13.3:           + "managed_by"                 = "terraform"
01:43:39.753 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
01:43:39.754 STDOUT terraform1.13.3:           + "zone_type"                  = "internal"
01:43:39.754 STDOUT terraform1.13.3:         }
01:43:39.754 STDOUT terraform1.13.3:       + visibility       = "private"
01:43:39.754 STDOUT terraform1.13.3:       + cloud_logging_config (known after apply)
01:43:39.754 STDOUT terraform1.13.3:       + dnssec_config (known after apply)
01:43:39.754 STDOUT terraform1.13.3:       + private_visibility_config {
01:43:39.754 STDOUT terraform1.13.3:           + networks {
01:43:39.754 STDOUT terraform1.13.3:               + network_url = "https://www.googleapis.com/compute/v1/projects/iac-01/global/networks/prd-vpc-australia-southeast2"
01:43:39.755 STDOUT terraform1.13.3:             }
01:43:39.755 STDOUT terraform1.13.3:         }
01:43:39.755 STDOUT terraform1.13.3:     }
01:43:39.755 STDOUT terraform1.13.3:   # google_dns_record_set.records["0"] will be created
01:43:39.755 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
01:43:39.755 STDOUT terraform1.13.3:       + id           = (known after apply)
01:43:39.755 STDOUT terraform1.13.3:       + managed_zone = "prd-nz3es-internal-zone"
01:43:39.755 STDOUT terraform1.13.3:       + name         = "db.nz3es.internal."
01:43:39.755 STDOUT terraform1.13.3:       + project      = "iac-01"
01:43:39.755 STDOUT terraform1.13.3:       + rrdatas      = [
01:43:39.755 STDOUT terraform1.13.3:           + "10.0.0.100",
01:43:39.755 STDOUT terraform1.13.3:         ]
01:43:39.755 STDOUT terraform1.13.3:       + ttl          = 300
01:43:39.755 STDOUT terraform1.13.3:       + type         = "A"
01:43:39.755 STDOUT terraform1.13.3:     }
01:43:39.755 STDOUT terraform1.13.3:   # google_dns_record_set.records["1"] will be created
01:43:39.756 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
01:43:39.756 STDOUT terraform1.13.3:       + id           = (known after apply)
01:43:39.756 STDOUT terraform1.13.3:       + managed_zone = "prd-nz3es-internal-zone"
01:43:39.756 STDOUT terraform1.13.3:       + name         = "cache.nz3es.internal."
01:43:39.756 STDOUT terraform1.13.3:       + project      = "iac-01"
01:43:39.756 STDOUT terraform1.13.3:       + rrdatas      = [
01:43:39.756 STDOUT terraform1.13.3:           + "10.0.0.101",
01:43:39.756 STDOUT terraform1.13.3:         ]
01:43:39.756 STDOUT terraform1.13.3:       + ttl          = 300
01:43:39.756 STDOUT terraform1.13.3:       + type         = "A"
01:43:39.756 STDOUT terraform1.13.3:     }
01:43:39.756 STDOUT terraform1.13.3:   # google_dns_record_set.records["2"] will be created
01:43:39.756 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
01:43:39.756 STDOUT terraform1.13.3:       + id           = (known after apply)
01:43:39.757 STDOUT terraform1.13.3:       + managed_zone = "prd-nz3es-internal-zone"
01:43:39.757 STDOUT terraform1.13.3:       + name         = "api.nz3es.internal."
01:43:39.757 STDOUT terraform1.13.3:       + project      = "iac-01"
01:43:39.757 STDOUT terraform1.13.3:       + rrdatas      = [
01:43:39.757 STDOUT terraform1.13.3:           + "10.0.0.102",
01:43:39.757 STDOUT terraform1.13.3:         ]
01:43:39.757 STDOUT terraform1.13.3:       + ttl          = 300
01:43:39.757 STDOUT terraform1.13.3:       + type         = "A"
01:43:39.757 STDOUT terraform1.13.3:     }
01:43:39.757 STDOUT terraform1.13.3: Plan: 4 to add, 0 to change, 0 to destroy.
01:43:39.757 STDOUT terraform1.13.3: 
01:43:39.757 STDOUT terraform1.13.3: Changes to Outputs:
01:43:39.757 STDOUT terraform1.13.3:   + name_servers = (known after apply)
01:43:39.757 STDOUT terraform1.13.3:   + zone_id      = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/prd/data-plane/australia-southeast2/dns-zone/nz3es-internal -w nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-internal
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fprd%252Fdata-plane%252Faustralia-southeast2%252Fdns-zone%252Fnz3es-internal%252Fnz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-internal)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/prd/data-plane/australia-southeast2/dns-zone/nz3es-internal -w nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-internal
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### Plan Summary

6 projects, 4 with changes, 2 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```